mdbsliguo/stm32_template_SPL/Drivers/i2c/i2c_hw.c
/**
 * @file i2c_hw.c
 * @brief 硬件I2C驱动模块实现
 * @version 1.0.0
 * @date 2024-01-01
 * @details 基于STM32标准外设库的硬件I2C驱动，支持主模式（轮询/中断/DMA）、7位/10位地址、总线扫描等功能
 */

/* Include config.h first to get module enable flags */
#include "config.h"

#if CONFIG_MODULE_I2C_ENABLED

/* Include our header */
#include "i2c_hw.h"

/* Note: We can directly use I2C_Init from the standard library since our function is named I2C_HW_Init */
#include "gpio.h"
#include "delay.h"
#include "nvic.h"
#include "dma.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_i2c.h"
#include "misc.h"
#include <stdbool.h>
#include <stddef.h>
#include <limits.h>

/* 从board.h加载配置 */
static I2C_Config_t g_i2c_configs[I2C_INSTANCE_MAX] = I2C_CONFIGS;

/* 初始化标志 */
static bool g_i2c_initialized[I2C_INSTANCE_MAX] = {false, false};

/* 默认超时时间（毫秒） */
#define I2C_DEFAULT_TIMEOUT_MS  1000

/* I2C_MasterWriteRegs最大长度限制（避免栈溢出） */
/* STM32F103C8T6的栈大小通常为2KB，这里限制为128字节是安全的 */
#define I2C_MAX_WRITE_REGS_LENGTH 128

/* 中断模式相关变量 */
static I2C_TransferMode_t g_i2c_transfer_mode[I2C_INSTANCE_MAX] = {I2C_MODE_POLLING, I2C_MODE_POLLING};
static I2C_Callback_t g_i2c_callback[I2C_INSTANCE_MAX] = {NULL, NULL};

/* 中断模式发送/接收缓冲区 */
static const uint8_t *g_i2c_tx_buffer[I2C_INSTANCE_MAX] = {NULL};
static uint8_t *g_i2c_rx_buffer[I2C_INSTANCE_MAX] = {NULL};
static uint16_t g_i2c_tx_length[I2C_INSTANCE_MAX] = {0};
static uint16_t g_i2c_tx_index[I2C_INSTANCE_MAX] = {0};
static uint16_t g_i2c_rx_length[I2C_INSTANCE_MAX] = {0};
static uint16_t g_i2c_rx_index[I2C_INSTANCE_MAX] = {0};
static uint8_t g_i2c_slave_addr[I2C_INSTANCE_MAX] = {0};
static I2C_Status_t g_i2c_status[I2C_INSTANCE_MAX] = {I2C_OK};

/* DMA通道映射（I2C TX/RX对应的DMA通道） */
/* 注意：I2C1使用DMA1_CH6(TX)/CH7(RX)，I2C2使用DMA1_CH4(TX)/CH5(RX) */
static const DMA_Channel_t i2c_tx_dma_channels[I2C_INSTANCE_MAX] = {
    DMA_CHANNEL_1_6,  /* I2C1 TX -> DMA1_CH6 */
    DMA_CHANNEL_1_4,  /* I2C2 TX -> DMA1_CH4 */
};

static const DMA_Channel_t i2c_rx_dma_channels[I2C_INSTANCE_MAX] = {
    DMA_CHANNEL_1_7,  /* I2C1 RX -> DMA1_CH7 */
    DMA_CHANNEL_1_5,  /* I2C2 RX -> DMA1_CH5 */
};

/**
 * @brief 获取I2C外设时钟
 * @param[in] i2c_periph I2C外设指针
 * @return uint32_t 时钟使能值，失败返回0
 */
static uint32_t I2C_GetPeriphClock(I2C_TypeDef *i2c_periph)
{
    if (i2c_periph == I2C1)
    {
        return RCC_APB1Periph_I2C1;
    }
    else if (i2c_periph == I2C2)
    {
        return RCC_APB1Periph_I2C2;
    }
    return 0;
}

/**
 * @brief 检查并配置I2C引脚重映射
 * @param[in] i2c_periph I2C外设指针
 * @param[in] scl_port SCL引脚端口
 * @param[in] scl_pin SCL引脚号
 * @return I2C_Status_t 错误码
 */
static I2C_Status_t I2C_ConfigRemap(I2C_TypeDef *i2c_periph, GPIO_TypeDef *scl_port, uint16_t scl_pin)
{
    /* I2C1重映射检查：PB8/PB9需要重映射 */
    if (i2c_periph == I2C1)
    {
        if (scl_port == GPIOB && scl_pin == GPIO_Pin_8)
        {
            /* 启用I2C1重映射到PB8/PB9 */
            GPIO_PinRemapConfig(GPIO_Remap_I2C1, ENABLE);
        }
        else if (scl_port == GPIOB && scl_pin == GPIO_Pin_6)
        {
            /* 默认引脚PB6/PB7，不需要重映射 */
            GPIO_PinRemapConfig(GPIO_Remap_I2C1, DISABLE);
        }
        else
        {
            /* 不支持的引脚配置 */
            return I2C_ERROR_GPIO_FAILED;
        }
    }
    /* I2C2不需要重映射 */
    else if (i2c_periph == I2C2)
    {
        if (scl_port != GPIOB || scl_pin != GPIO_Pin_10)
        {
            /* I2C2只支持PB10/PB11 */
            return I2C_ERROR_GPIO_FAILED;
        }
    }
    else
    {
        return I2C_ERROR_INVALID_PERIPH;
    }
    
    return I2C_OK;
}

/**
 * @brief 等待I2C标志位
 * @param[in] i2c_periph I2C外设指针
 * @param[in] flag 标志位
 * @param[in] timeout_ms 超时时间（毫秒）
 * @return I2C_Status_t 错误码
 */
static I2C_Status_t I2C_WaitFlag(I2C_TypeDef *i2c_periph, uint32_t flag, uint32_t timeout_ms)
{
    uint32_t start_tick = Delay_GetTick();
    
    while (!I2C_CheckEvent(i2c_periph, flag))
    {
        /* 检查超时（使用Delay_GetElapsed处理溢出） */
        uint32_t elapsed = Delay_GetElapsed(Delay_GetTick(), start_tick);
        if (elapsed > timeout_ms)
        {
            return I2C_ERROR_TIMEOUT;
        }
        
        /* 检查错误标志 */
        if (I2C_GetFlagStatus(i2c_periph, I2C_FLAG_AF) != RESET)
        {
            I2C_ClearFlag(i2c_periph, I2C_FLAG_AF);
            return I2C_ERROR_NACK;
        }
        if (I2C_GetFlagStatus(i2c_periph, I2C_FLAG_ARLO) != RESET)
        {
            I2C_ClearFlag(i2c_periph, I2C_FLAG_ARLO);
            return I2C_ERROR_ARBITRATION_LOST;
        }
        if (I2C_GetFlagStatus(i2c_periph, I2C_FLAG_BERR) != RESET)
        {
            I2C_ClearFlag(i2c_periph, I2C_FLAG_BERR);
            return I2C_ERROR_BUS_ERROR;
        }
    }
    
    return I2C_OK;
}

/**
 * @brief 等待I2C总线空闲
 * @param[in] i2c_periph I2C外设指针
 * @param[in] timeout_ms 超时时间（毫秒）
 * @return I2C_Status_t 错误码
 */
static I2C_Status_t I2C_WaitBusIdle(I2C_TypeDef *i2c_periph, uint32_t timeout_ms)
{
    uint32_t start_tick = Delay_GetTick();
    
    while (I2C_GetFlagStatus(i2c_periph, I2C_FLAG_BUSY) != RESET)
    {
        /* 检查超时（使用Delay_GetElapsed处理溢出） */
        uint32_t elapsed = Delay_GetElapsed(Delay_GetTick(), start_tick);
        if (elapsed > timeout_ms)
        {
            return I2C_ERROR_BUSY;
        }
    }
    
    return I2C_OK;
}

/**
 * @brief 硬件I2C初始化
 */
I2C_Status_t I2C_HW_Init(I2C_Instance_t instance)
{
    I2C_Status_t status;
    GPIO_Status_t gpio_status;
    I2C_InitTypeDef I2C_InitStructure;
    GPIO_InitTypeDef GPIO_InitStructure;
    uint32_t i2c_clock;
    
    /* 参数校验 */
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_configs[instance].enabled)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (g_i2c_configs[instance].i2c_periph == NULL)
    {
        return I2C_ERROR_INVALID_PERIPH;
    }
    
    /* 检查是否已初始化 */
    if (g_i2c_initialized[instance])
    {
        return I2C_OK;
    }
    
    /* 获取I2C外设时钟 */
    i2c_clock = I2C_GetPeriphClock(g_i2c_configs[instance].i2c_periph);
    if (i2c_clock == 0)
    {
        return I2C_ERROR_INVALID_PERIPH;
    }
    
    /* 使能I2C外设时钟 */
    RCC_APB1PeriphClockCmd(i2c_clock, ENABLE);
    
