mdbsliguo/stm32_template_SPL/Drivers/i2c/i2c_hw.c
    /* 使能GPIO时钟 */
    gpio_status = GPIO_EnableClock(g_i2c_configs[instance].scl_port);
    if (gpio_status != GPIO_OK)
    {
        return I2C_ERROR_GPIO_FAILED;
    }
    
    if (g_i2c_configs[instance].scl_port != g_i2c_configs[instance].sda_port)
    {
        gpio_status = GPIO_EnableClock(g_i2c_configs[instance].sda_port);
        if (gpio_status != GPIO_OK)
        {
            return I2C_ERROR_GPIO_FAILED;
        }
    }
    
    /* 配置I2C引脚重映射（如果需要） */
    status = I2C_ConfigRemap(g_i2c_configs[instance].i2c_periph,
                              g_i2c_configs[instance].scl_port,
                              g_i2c_configs[instance].scl_pin);
    if (status != I2C_OK)
    {
        return status;
    }
    
    /* 配置SCL引脚为复用开漏输出 */
    GPIO_InitStructure.GPIO_Pin = g_i2c_configs[instance].scl_pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(g_i2c_configs[instance].scl_port, &GPIO_InitStructure);
    
    /* 配置SDA引脚为复用开漏输出 */
    GPIO_InitStructure.GPIO_Pin = g_i2c_configs[instance].sda_pin;
    GPIO_Init(g_i2c_configs[instance].sda_port, &GPIO_InitStructure);
    
    /* 配置I2C外设 */
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = g_i2c_configs[instance].own_address;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed = g_i2c_configs[instance].clock_speed;
    
    /* Call the standard library's I2C_Init function */
    I2C_Init(g_i2c_configs[instance].i2c_periph, &I2C_InitStructure);
    
    /* 使能I2C外设 */
    I2C_Cmd(g_i2c_configs[instance].i2c_periph, ENABLE);
    
    /* 标记为已初始化 */
    g_i2c_initialized[instance] = true;
    
    return I2C_OK;
}

/**
 * @brief I2C反初始化
 */
I2C_Status_t I2C_Deinit(I2C_Instance_t instance)
{
    uint32_t i2c_clock;
    
    /* 参数校验 */
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_OK;
    }
    
    /* 禁用I2C外设 */
    I2C_Cmd(g_i2c_configs[instance].i2c_periph, DISABLE);
    
    /* 获取I2C外设时钟 */
    i2c_clock = I2C_GetPeriphClock(g_i2c_configs[instance].i2c_periph);
    if (i2c_clock != 0)
    {
        /* 禁用I2C外设时钟 */
        RCC_APB1PeriphClockCmd(i2c_clock, DISABLE);
    }
    
    /* 标记为未初始化 */
    g_i2c_initialized[instance] = false;
    
    return I2C_OK;
}

/**
 * @brief I2C主模式发送数据
 */
I2C_Status_t I2C_MasterTransmit(I2C_Instance_t instance, uint8_t slave_addr, 
                                 const uint8_t *data, uint16_t length, uint32_t timeout)
{
    I2C_TypeDef *i2c_periph;
    I2C_Status_t status;
    uint16_t i;
    uint32_t actual_timeout;
    
    /* 参数校验 */
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    actual_timeout = (timeout == 0) ? I2C_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 等待总线空闲 */
    status = I2C_WaitBusIdle(i2c_periph, actual_timeout);
    if (status != I2C_OK)
    {
        return status;
    }
    
    /* 生成START信号 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送从机地址（写模式） */
    I2C_Send7bitAddress(i2c_periph, slave_addr << 1, I2C_Direction_Transmitter);
    
    /* 等待地址发送完成并收到ACK */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送数据 */
    /* 注意：地址发送完成后（EV6），TXE应该已经置位，第一个字节可以直接发送 */
    for (i = 0; i < length; i++)
    {
        /* 第一个字节：地址发送完成后TXE已置位，可以直接发送 */
        /* 后续字节：需要等待TXE标志 */
        if (i > 0)
        {
            /* 等待数据寄存器为空（TXE标志） */
            status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_TRANSMITTING, actual_timeout);
            if (status != I2C_OK)
            {
                I2C_GenerateSTOP(i2c_periph, ENABLE);
                return status;
            }
        }
        
        /* 发送数据 */
        I2C_SendData(i2c_periph, data[i]);
    }
    
    /* 等待最后一个字节发送完成（BTF标志） */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_TRANSMITTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 生成STOP信号 */
    I2C_GenerateSTOP(i2c_periph, ENABLE);
    
    return I2C_OK;
}

/**
 * @brief I2C主模式接收数据
 */
I2C_Status_t I2C_MasterReceive(I2C_Instance_t instance, uint8_t slave_addr, 
                                uint8_t *data, uint16_t length, uint32_t timeout)
{
    I2C_TypeDef *i2c_periph;
    I2C_Status_t status;
    uint16_t i;
    uint32_t actual_timeout;
    
    /* 参数校验 */
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    actual_timeout = (timeout == 0) ? I2C_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 等待总线空闲 */
    status = I2C_WaitBusIdle(i2c_periph, actual_timeout);
    if (status != I2C_OK)
    {
        return status;
    }
    
    /* 使能ACK */
    I2C_AcknowledgeConfig(i2c_periph, ENABLE);
    
    /* 生成START信号 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送从机地址（读模式） */
    I2C_Send7bitAddress(i2c_periph, slave_addr << 1, I2C_Direction_Receiver);
    
