mdbsliguo/stm32_template_SPL/Drivers/i2c/i2c_hw.c
    /* 等待地址发送完成并收到ACK */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 接收数据 */
    if (length == 1)
    {
        /* 单字节接收：禁用ACK，生成STOP */
        I2C_AcknowledgeConfig(i2c_periph, DISABLE);
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        
        /* 等待数据接收完成 */
        status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_RECEIVED, actual_timeout);
        if (status != I2C_OK)
        {
            return status;
        }
        
        /* 读取数据 */
        data[0] = I2C_ReceiveData(i2c_periph);
    }
    else
    {
        /* 多字节接收 */
        for (i = 0; i < length; i++)
        {
            /* 等待数据接收完成 */
            status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_RECEIVED, actual_timeout);
            if (status != I2C_OK)
            {
                return status;
            }
            
            /* 读取数据 */
            data[i] = I2C_ReceiveData(i2c_periph);
            
            /* 如果是倒数第二个字节，禁用ACK（为最后一个字节做准备） */
            if (i == length - 2)
            {
                I2C_AcknowledgeConfig(i2c_periph, DISABLE);
            }
            
            /* 如果是最后一个字节，生成STOP */
            if (i == length - 1)
            {
                I2C_GenerateSTOP(i2c_periph, ENABLE);
            }
        }
    }
    
    return I2C_OK;
}

/**
 * @brief I2C主模式写寄存器
 */
I2C_Status_t I2C_MasterWriteReg(I2C_Instance_t instance, uint8_t slave_addr, 
                                 uint8_t reg_addr, uint8_t reg_value, uint32_t timeout)
{
    uint8_t tx_data[2];
    
    tx_data[0] = reg_addr;
    tx_data[1] = reg_value;
    
    return I2C_MasterTransmit(instance, slave_addr, tx_data, 2, timeout);
}

/**
 * @brief I2C主模式读寄存器（使用Repeated START）
 */
I2C_Status_t I2C_MasterReadReg(I2C_Instance_t instance, uint8_t slave_addr, 
                                 uint8_t reg_addr, uint8_t *reg_value, uint32_t timeout)
{
    I2C_TypeDef *i2c_periph;
    I2C_Status_t status;
    uint32_t actual_timeout;
    
    if (reg_value == NULL)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (instance >= I2C_INSTANCE_MAX || !g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    actual_timeout = (timeout == 0) ? I2C_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 等待总线空闲 */
    status = I2C_WaitBusIdle(i2c_periph, actual_timeout);
    if (status != I2C_OK)
    {
        return status;
    }
    
    /* 生成START信号 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送从机地址（写模式） */
    I2C_Send7bitAddress(i2c_periph, slave_addr << 1, I2C_Direction_Transmitter);
    
    /* 等待地址发送完成并收到ACK */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送寄存器地址 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_TRANSMITTING, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    I2C_SendData(i2c_periph, reg_addr);
    
    /* 等待寄存器地址发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_TRANSMITTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 生成Repeated START信号 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待Repeated START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送从机地址（读模式） */
    I2C_Send7bitAddress(i2c_periph, slave_addr << 1, I2C_Direction_Receiver);
    
    /* 等待地址发送完成并收到ACK */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 单字节接收：禁用ACK，生成STOP */
    I2C_AcknowledgeConfig(i2c_periph, DISABLE);
    I2C_GenerateSTOP(i2c_periph, ENABLE);
    
    /* 等待数据接收完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_RECEIVED, actual_timeout);
    if (status != I2C_OK)
    {
        return status;
    }
    
    /* 读取数据 */
    *reg_value = I2C_ReceiveData(i2c_periph);
    
    return I2C_OK;
}

/**
 * @brief I2C主模式写多个寄存器
 */
I2C_Status_t I2C_MasterWriteRegs(I2C_Instance_t instance, uint8_t slave_addr, 
                                  uint8_t reg_addr, const uint8_t *data, uint16_t length, uint32_t timeout)
{
    uint16_t i;
    
    /* 参数校验 */
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    /* 分配临时缓冲区（寄存器地址 + 数据） */
    /* 注意：这里使用栈分配，限制最大长度避免栈溢出 */
    if (length > I2C_MAX_WRITE_REGS_LENGTH)
    {
        return I2C_ERROR_INVALID_PARAM;  /* 超过最大长度限制 */
    }
    
    uint8_t tx_buf[I2C_MAX_WRITE_REGS_LENGTH + 1];
    tx_buf[0] = reg_addr;
    for (i = 0; i < length; i++)
    {
        tx_buf[i + 1] = data[i];
    }
    
    return I2C_MasterTransmit(instance, slave_addr, tx_buf, length + 1, timeout);
}

/**
 * @brief I2C主模式读多个寄存器（使用Repeated START）
 */
I2C_Status_t I2C_MasterReadRegs(I2C_Instance_t instance, uint8_t slave_addr, 
                                  uint8_t reg_addr, uint8_t *data, uint16_t length, uint32_t timeout)
{
    I2C_TypeDef *i2c_periph;
    I2C_Status_t status;
    uint16_t i;
    uint32_t actual_timeout;
    
