mdbsliguo/stm32_template_SPL/Drivers/i2c/i2c_hw.c
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (instance >= I2C_INSTANCE_MAX || !g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    actual_timeout = (timeout == 0) ? I2C_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 等待总线空闲 */
    status = I2C_WaitBusIdle(i2c_periph, actual_timeout);
    if (status != I2C_OK)
    {
        return status;
    }
    
    /* 生成START信号 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送从机地址（写模式） */
    I2C_Send7bitAddress(i2c_periph, slave_addr << 1, I2C_Direction_Transmitter);
    
    /* 等待地址发送完成并收到ACK */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送寄存器地址 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_TRANSMITTING, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    I2C_SendData(i2c_periph, reg_addr);
    
    /* 等待寄存器地址发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_TRANSMITTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 生成Repeated START信号 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待Repeated START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送从机地址（读模式） */
    I2C_Send7bitAddress(i2c_periph, slave_addr << 1, I2C_Direction_Receiver);
    
    /* 等待地址发送完成并收到ACK */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 使能ACK */
    I2C_AcknowledgeConfig(i2c_periph, ENABLE);
    
    /* 接收数据 */
    if (length == 1)
    {
        /* 单字节接收：禁用ACK，生成STOP */
        I2C_AcknowledgeConfig(i2c_periph, DISABLE);
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        
        /* 等待数据接收完成 */
        status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_RECEIVED, actual_timeout);
        if (status != I2C_OK)
        {
            return status;
        }
        
        /* 读取数据 */
        data[0] = I2C_ReceiveData(i2c_periph);
    }
    else
    {
        /* 多字节接收 */
        for (i = 0; i < length; i++)
        {
            /* 等待数据接收完成 */
            status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_RECEIVED, actual_timeout);
            if (status != I2C_OK)
            {
                return status;
            }
            
            /* 读取数据 */
            data[i] = I2C_ReceiveData(i2c_periph);
            
            /* 如果是倒数第二个字节，禁用ACK（为最后一个字节做准备） */
            if (i == length - 2)
            {
                I2C_AcknowledgeConfig(i2c_periph, DISABLE);
            }
            
            /* 如果是最后一个字节，生成STOP */
            if (i == length - 1)
            {
                I2C_GenerateSTOP(i2c_periph, ENABLE);
            }
        }
    }
    
    return I2C_OK;
}

/**
 * @brief 检查I2C是否已初始化
 */
uint8_t I2C_IsInitialized(I2C_Instance_t instance)
{
    if (instance >= I2C_INSTANCE_MAX)
    {
        return 0;
    }
    
    return g_i2c_initialized[instance] ? 1 : 0;
}

/**
 * @brief 获取I2C外设指针
 */
I2C_TypeDef* I2C_GetPeriph(I2C_Instance_t instance)
{
    if (instance >= I2C_INSTANCE_MAX)
    {
        return NULL;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return NULL;
    }
    
    return g_i2c_configs[instance].i2c_periph;
}

/**
 * @brief I2C软件复位
 */
I2C_Status_t I2C_SoftwareReset(I2C_Instance_t instance)
{
    I2C_TypeDef *i2c_periph;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 执行软件复位 */
    I2C_SoftwareResetCmd(i2c_periph, ENABLE);
    I2C_SoftwareResetCmd(i2c_periph, DISABLE);
    
    /* 清除所有错误标志 */
    I2C_ClearFlag(i2c_periph, I2C_FLAG_AF);
    I2C_ClearFlag(i2c_periph, I2C_FLAG_ARLO);
    I2C_ClearFlag(i2c_periph, I2C_FLAG_BERR);
    
    return I2C_OK;
}

/**
 * @brief 检查I2C总线是否忙
 */
uint8_t I2C_IsBusBusy(I2C_Instance_t instance)
{
    I2C_TypeDef *i2c_periph;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return 0;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return 0;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    return (I2C_GetFlagStatus(i2c_periph, I2C_FLAG_BUSY) != RESET) ? 1 : 0;
}

/**
 * @brief I2C总线扫描
 */
I2C_Status_t I2C_ScanBus(I2C_Instance_t instance, uint8_t *found_addr, uint8_t max_count, uint8_t *count, uint32_t timeout)
{
    I2C_TypeDef *i2c_periph;
    I2C_Status_t status;
    uint8_t addr;
    uint8_t found = 0;
    uint32_t actual_timeout;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (found_addr == NULL || count == NULL || max_count == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    actual_timeout = (timeout == 0) ? 10 : timeout;  /* 扫描使用较短的超时时间 */
    
    *count = 0;
    
    /* 扫描地址范围：0x08-0x77（7位地址，排除保留地址0x00-0x07和0x78-0x7F） */
    for (addr = 0x08; addr <= 0x77 && found < max_count; addr++)
    {
        /* 等待总线空闲（使用I2C_WaitBusIdle统一处理） */
        status = I2C_WaitBusIdle(i2c_periph, 10);  /* 最多等待10ms */
        if (status != I2C_OK)
        {
            continue;  /* 总线忙，跳过这个地址 */
        }
        
        /* 生成START信号 */
        I2C_GenerateSTART(i2c_periph, ENABLE);
        
        /* 等待START信号发送完成 */
        status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
        if (status != I2C_OK)
        {
            I2C_GenerateSTOP(i2c_periph, ENABLE);
            continue;
        }
        
        /* 发送从机地址（写模式） */
        I2C_Send7bitAddress(i2c_periph, addr << 1, I2C_Direction_Transmitter);
        
        /* 等待地址发送完成（使用I2C_WaitFlag统一处理） */
        status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, actual_timeout);
        
        /* 如果收到ACK，说明设备存在 */
        if (status == I2C_OK)
        {
            found_addr[found] = addr;
            found++;
        }
        
