mdbsliguo/stm32_template_SPL/Drivers/i2c/i2c_hw.c
        /* 无论成功与否，都需要生成STOP信号 */
        /* 如果之前已经因为错误生成了STOP，这里再次生成也是安全的（幂等操作） */
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        
        /* 等待STOP信号完成（使用短延时，避免阻塞） */
        /* 注意：这里使用Delay_us而不是Delay_ms，减少延时时间 */
        Delay_us(100);  /* 100微秒足够STOP信号完成 */
    }
    
    *count = found;
    return I2C_OK;
}

/**
 * @brief I2C主模式发送数据（10位地址）
 */
I2C_Status_t I2C_MasterTransmit10bit(I2C_Instance_t instance, uint16_t slave_addr, 
                                      const uint8_t *data, uint16_t length, uint32_t timeout)
{
    I2C_TypeDef *i2c_periph;
    I2C_Status_t status;
    uint16_t i;
    uint32_t actual_timeout;
    
    /* 参数校验 */
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (slave_addr > 0x3FF)
    {
        return I2C_ERROR_INVALID_PARAM;  /* 10位地址范围：0x000-0x3FF */
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    actual_timeout = (timeout == 0) ? I2C_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 等待总线空闲 */
    status = I2C_WaitBusIdle(i2c_periph, actual_timeout);
    if (status != I2C_OK)
    {
        return status;
    }
    
    /* 生成START信号 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送10位地址的第一字节（11110XX + 地址高2位 + R/W=0） */
    /* 格式：11110 + 地址[9:8] + 0（写） */
    uint8_t addr_byte1 = 0xF0 | ((slave_addr >> 7) & 0x06);
    I2C_SendData(i2c_periph, addr_byte1);
    
    /* 等待地址发送完成（EV9事件） */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_ADDRESS10, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送10位地址的第二字节（地址低8位） */
    /* 根据STM32标准库文档，第二字节使用I2C_Send7bitAddress发送 */
    /* 注意：对于10位地址，这里发送的是地址低8位，I2C_Send7bitAddress会正确处理 */
    I2C_Send7bitAddress(i2c_periph, (uint8_t)(slave_addr & 0xFF), I2C_Direction_Transmitter);
    
    /* 等待地址发送完成并收到ACK（EV6事件） */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送数据 */
    /* 注意：地址发送完成后（EV6），TXE应该已经置位，第一个字节可以直接发送 */
    for (i = 0; i < length; i++)
    {
        /* 第一个字节：地址发送完成后TXE已置位，可以直接发送 */
        /* 后续字节：需要等待TXE标志 */
        if (i > 0)
        {
            /* 等待数据寄存器为空 */
            status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_TRANSMITTING, actual_timeout);
            if (status != I2C_OK)
            {
                I2C_GenerateSTOP(i2c_periph, ENABLE);
                return status;
            }
        }
        
        /* 发送数据 */
        I2C_SendData(i2c_periph, data[i]);
    }
    
    /* 等待最后一个字节发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_TRANSMITTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 生成STOP信号 */
    I2C_GenerateSTOP(i2c_periph, ENABLE);
    
    return I2C_OK;
}

/**
 * @brief I2C主模式接收数据（10位地址）
 */
I2C_Status_t I2C_MasterReceive10bit(I2C_Instance_t instance, uint16_t slave_addr, 
                                     uint8_t *data, uint16_t length, uint32_t timeout)
{
    I2C_TypeDef *i2c_periph;
    I2C_Status_t status;
    uint16_t i;
    uint32_t actual_timeout;
    
    /* 参数校验 */
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (slave_addr > 0x3FF)
    {
        return I2C_ERROR_INVALID_PARAM;  /* 10位地址范围：0x000-0x3FF */
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    actual_timeout = (timeout == 0) ? I2C_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 等待总线空闲 */
    status = I2C_WaitBusIdle(i2c_periph, actual_timeout);
    if (status != I2C_OK)
    {
        return status;
    }
    
    /* 使能ACK */
    I2C_AcknowledgeConfig(i2c_periph, ENABLE);
    
    /* 生成START信号 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送10位地址的第一字节（11110XX + 地址高2位 + R/W=1） */
    /* 格式：11110 + 地址[9:8] + 1（读） */
    uint8_t addr_byte1 = 0xF0 | ((slave_addr >> 7) & 0x06) | 0x01;
    I2C_SendData(i2c_periph, addr_byte1);
    
    /* 等待地址发送完成（EV9事件） */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_ADDRESS10, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送10位地址的第二字节（地址低8位） */
    /* 根据STM32标准库文档，第二字节使用I2C_Send7bitAddress发送 */
    /* 注意：对于10位地址，这里发送的是地址低8位，I2C_Send7bitAddress会正确处理 */
    I2C_Send7bitAddress(i2c_periph, (uint8_t)(slave_addr & 0xFF), I2C_Direction_Receiver);
    
    /* 等待地址发送完成并收到ACK（EV6事件） */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 接收数据 */
    if (length == 1)
    {
        /* 单字节接收：禁用ACK，生成STOP */
        I2C_AcknowledgeConfig(i2c_periph, DISABLE);
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        
        /* 等待数据接收完成 */
        status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_RECEIVED, actual_timeout);
        if (status != I2C_OK)
        {
            return status;
        }
        
        /* 读取数据 */
        data[0] = I2C_ReceiveData(i2c_periph);
    }
    else
    {
        /* 多字节接收 */
        for (i = 0; i < length; i++)
        {
            /* 等待数据接收完成 */
            status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_RECEIVED, actual_timeout);
            if (status != I2C_OK)
            {
                return status;
            }
            
            /* 读取数据 */
            data[i] = I2C_ReceiveData(i2c_periph);
            
            /* 如果是倒数第二个字节，禁用ACK（为最后一个字节做准备） */
            if (i == length - 2)
            {
                I2C_AcknowledgeConfig(i2c_periph, DISABLE);
            }
            
