mdbsliguo/stm32_template_SPL/Drivers/i2c/i2c_hw.c
            /* 如果是最后一个字节，生成STOP */
            if (i == length - 1)
            {
                I2C_GenerateSTOP(i2c_periph, ENABLE);
            }
        }
    }
    
    return I2C_OK;
}

/**
 * @brief 获取I2C配置信息
 */
I2C_Status_t I2C_GetConfig(I2C_Instance_t instance, I2C_ConfigInfo_t *config_info)
{
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (config_info == NULL)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    config_info->i2c_periph = g_i2c_configs[instance].i2c_periph;
    config_info->clock_speed = g_i2c_configs[instance].clock_speed;
    config_info->own_address = g_i2c_configs[instance].own_address;
    config_info->address_mode = 0;  /* 当前只支持7位地址 */
    config_info->enabled = g_i2c_configs[instance].enabled;
    
    return I2C_OK;
}

/* 传输模式和回调函数（预留接口，用于中断/DMA模式） */
/* 当前版本仅支持轮询模式，这些变量为预留接口，暂时未使用 */
static I2C_TransferMode_t g_i2c_transfer_mode[I2C_INSTANCE_MAX] = {I2C_MODE_POLLING, I2C_MODE_POLLING};
static I2C_Callback_t g_i2c_callback[I2C_INSTANCE_MAX] = {NULL, NULL};

/* 抑制未使用变量警告（预留接口） */
#if defined(__GNUC__) || defined(__clang__)
__attribute__((unused))
#elif defined(__ICCARM__)
#pragma diag_suppress=177
#elif defined(__CC_ARM)
#pragma diag_suppress 177
#endif

/**
 * @brief 设置I2C传输模式
 */
I2C_Status_t I2C_SetTransferMode(I2C_Instance_t instance, I2C_TransferMode_t mode)
{
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (mode >= 3)  /* I2C_MODE_DMA = 2 */
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    /* 当前版本仅支持轮询模式 */
    if (mode != I2C_MODE_POLLING)
    {
        return I2C_ERROR_INVALID_PARAM;  /* 中断和DMA模式为预留接口 */
    }
    
    g_i2c_transfer_mode[instance] = mode;
    (void)g_i2c_transfer_mode;  /* 抑制未使用变量警告（预留接口） */
    
    return I2C_OK;
}

/**
 * @brief 设置I2C中断回调函数
 */
I2C_Status_t I2C_SetCallback(I2C_Instance_t instance, I2C_Callback_t callback)
{
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    g_i2c_callback[instance] = callback;
    (void)g_i2c_callback;  /* 抑制未使用变量警告（预留接口） */
    
    return I2C_OK;
}

/**
 * @brief I2C主模式发送数据（DMA模式）
 */
I2C_Status_t I2C_MasterTransmitDMA(I2C_Instance_t instance, uint8_t slave_addr, 
                                    const uint8_t *data, uint16_t length)
{
    I2C_TypeDef *i2c_periph;
    DMA_Channel_t dma_channel;
    DMA_Status_t dma_status;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    dma_channel = i2c_tx_dma_channels[instance];
    
    /* 检查DMA通道是否已初始化 */
    if (!DMA_IsInitialized(dma_channel))
    {
        dma_status = DMA_Init(dma_channel);
        if (dma_status != DMA_OK)
        {
            return I2C_ERROR_INVALID_PARAM;
        }
    }
    
    /* 停止之前的传输 */
    DMA_Stop(dma_channel);
    
    /* 配置DMA传输（内存到外设） */
    dma_status = DMA_ConfigTransfer(dma_channel, (uint32_t)&i2c_periph->DR,
                                    (uint32_t)data, length,
                                    DMA_DIR_MEMORY_TO_PERIPHERAL, 1);
    if (dma_status != DMA_OK)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    /* 使能I2C DMA发送请求 */
    I2C_DMACmd(i2c_periph, I2C_DMAReq_Tx, ENABLE);
    
    /* 生成START条件并发送地址 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待START位 */
    uint32_t timeout = Delay_GetTick() + I2C_DEFAULT_TIMEOUT_MS;
    while (!I2C_CheckEvent(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT))
    {
        if (Delay_GetElapsed(Delay_GetTick(), timeout) > I2C_DEFAULT_TIMEOUT_MS)
        {
            I2C_DMACmd(i2c_periph, I2C_DMAReq_Tx, DISABLE);
            return I2C_ERROR_TIMEOUT;
        }
    }
    
    /* 发送从机地址（写） */
    I2C_Send7bitAddress(i2c_periph, slave_addr << 1, I2C_Direction_Transmitter);
    
    /* 等待地址发送完成 */
    timeout = Delay_GetTick() + I2C_DEFAULT_TIMEOUT_MS;
    while (!I2C_CheckEvent(i2c_periph, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
    {
        if (Delay_GetElapsed(Delay_GetTick(), timeout) > I2C_DEFAULT_TIMEOUT_MS)
        {
            I2C_DMACmd(i2c_periph, I2C_DMAReq_Tx, DISABLE);
            return I2C_ERROR_TIMEOUT;
        }
    }
    
    /* 启动DMA传输 */
    dma_status = DMA_Start(dma_channel);
    if (dma_status != DMA_OK)
    {
        I2C_DMACmd(i2c_periph, I2C_DMAReq_Tx, DISABLE);
        return I2C_ERROR_INVALID_PARAM;
    }
    
    return I2C_OK;
}

/**
 * @brief I2C主模式接收数据（DMA模式）
 */
I2C_Status_t I2C_MasterReceiveDMA(I2C_Instance_t instance, uint8_t slave_addr, 
                                   uint8_t *data, uint16_t length)
{
    I2C_TypeDef *i2c_periph;
    DMA_Channel_t dma_channel;
    DMA_Status_t dma_status;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    dma_channel = i2c_rx_dma_channels[instance];
    
    /* 检查DMA通道是否已初始化 */
    if (!DMA_IsInitialized(dma_channel))
    {
        dma_status = DMA_Init(dma_channel);
        if (dma_status != DMA_OK)
        {
            return I2C_ERROR_INVALID_PARAM;
        }
    }
    
    /* 停止之前的传输 */
    DMA_Stop(dma_channel);
    
    /* 配置DMA传输（外设到内存） */
    dma_status = DMA_ConfigTransfer(dma_channel, (uint32_t)&i2c_periph->DR,
                                    (uint32_t)data, length,
                                    DMA_DIR_PERIPHERAL_TO_MEMORY, 1);
    if (dma_status != DMA_OK)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    /* 使能I2C DMA接收请求 */
    I2C_DMACmd(i2c_periph, I2C_DMAReq_Rx, ENABLE);
    
    /* 生成START条件并发送地址 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待START位 */
    uint32_t timeout = Delay_GetTick() + I2C_DEFAULT_TIMEOUT_MS;
    while (!I2C_CheckEvent(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT))
    {
        if (Delay_GetElapsed(Delay_GetTick(), timeout) > I2C_DEFAULT_TIMEOUT_MS)
        {
            I2C_DMACmd(i2c_periph, I2C_DMAReq_Rx, DISABLE);
            return I2C_ERROR_TIMEOUT;
        }
    }
    
    /* 发送从机地址（读） */
    if (length == 1)
    {
        I2C_AcknowledgeConfig(i2c_periph, DISABLE);
    }
    I2C_Send7bitAddress(i2c_periph, slave_addr << 1, I2C_Direction_Receiver);
    
    /* 等待地址发送完成 */
    timeout = Delay_GetTick() + I2C_DEFAULT_TIMEOUT_MS;
    while (!I2C_CheckEvent(i2c_periph, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
    {
        if (Delay_GetElapsed(Delay_GetTick(), timeout) > I2C_DEFAULT_TIMEOUT_MS)
        {
            I2C_DMACmd(i2c_periph, I2C_DMAReq_Rx, DISABLE);
            return I2C_ERROR_TIMEOUT;
        }
    }
    
    if (length == 1)
    {
        I2C_AcknowledgeConfig(i2c_periph, DISABLE);
        I2C_GenerateSTOP(i2c_periph, ENABLE);
    }
    else if (length == 2)
    {
        I2C_AcknowledgeConfig(i2c_periph, DISABLE);
    }
    
