mdbsliguo/stm32_template_SPL/Drivers/i2c/i2c_hw.c
    /* 启动DMA传输 */
    dma_status = DMA_Start(dma_channel);
    if (dma_status != DMA_OK)
    {
        I2C_DMACmd(i2c_periph, I2C_DMAReq_Rx, DISABLE);
        return I2C_ERROR_INVALID_PARAM;
    }
    
    return I2C_OK;
}

/* ========== 中断模式功能实现 ========== */

/**
 * @brief 获取I2C中断向量
 */
static void I2C_GetIRQn(I2C_Instance_t instance, IRQn_Type *ev_irqn, IRQn_Type *er_irqn)
{
    if (instance == I2C_INSTANCE_1)
    {
        *ev_irqn = I2C1_EV_IRQn;
        *er_irqn = I2C1_ER_IRQn;
    }
    else
    {
        *ev_irqn = I2C2_EV_IRQn;
        *er_irqn = I2C2_ER_IRQn;
    }
}

/**
 * @brief I2C非阻塞发送（中断模式）
 */
I2C_Status_t I2C_MasterTransmitIT(I2C_Instance_t instance, uint8_t slave_addr, 
                                   const uint8_t *data, uint16_t length)
{
    I2C_TypeDef *i2c_periph;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (g_i2c_transfer_mode[instance] != I2C_MODE_INTERRUPT)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (g_i2c_tx_buffer[instance] != NULL)
    {
        return I2C_ERROR_BUSY;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 保存发送缓冲区信息 */
    g_i2c_tx_buffer[instance] = data;
    g_i2c_tx_length[instance] = length;
    g_i2c_tx_index[instance] = 0;
    g_i2c_slave_addr[instance] = slave_addr;
    g_i2c_status[instance] = I2C_OK;
    
    /* 生成START条件 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    return I2C_OK;
}

/**
 * @brief I2C非阻塞接收（中断模式）
 */
I2C_Status_t I2C_MasterReceiveIT(I2C_Instance_t instance, uint8_t slave_addr, 
                                  uint8_t *data, uint16_t length)
{
    I2C_TypeDef *i2c_periph;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (g_i2c_transfer_mode[instance] != I2C_MODE_INTERRUPT)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (g_i2c_rx_buffer[instance] != NULL)
    {
        return I2C_ERROR_BUSY;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 保存接收缓冲区信息 */
    g_i2c_rx_buffer[instance] = data;
    g_i2c_rx_length[instance] = length;
    g_i2c_rx_index[instance] = 0;
    g_i2c_slave_addr[instance] = slave_addr;
    g_i2c_status[instance] = I2C_OK;
    
    /* 生成START条件 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    return I2C_OK;
}

/**
 * @brief I2C事件中断服务函数
 */
void I2C_EV_IRQHandler(I2C_Instance_t instance)
{
    I2C_TypeDef *i2c_periph;
    uint32_t sr1, sr2;
    uint32_t event;
    uint8_t data;
    
    if (instance >= I2C_INSTANCE_MAX || !g_i2c_initialized[instance])
    {
        return;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    sr1 = i2c_periph->SR1;
    sr2 = i2c_periph->SR2;
    
    /* 从模式处理 */
    if (g_i2c_slave_mode[instance] && g_i2c_slave_callback[instance] != NULL)
    {
        /* 地址匹配事件 */
        if (sr1 & I2C_FLAG_ADDR)
        {
            event = I2C_GetLastEvent(i2c_periph);
            
            /* 从机接收模式（主机写） */
            if (event == I2C_EVENT_SLAVE_RECEIVER_ADDRESS_MATCHED)
            {
                g_i2c_slave_callback[instance](instance, I2C_EVENT_SLAVE_RECEIVER_ADDRESS_MATCHED, 0, g_i2c_slave_user_data[instance]);
            }
            /* 从机发送模式（主机读） */
            else if (event == I2C_EVENT_SLAVE_TRANSMITTER_ADDRESS_MATCHED)
            {
                g_i2c_slave_callback[instance](instance, I2C_EVENT_SLAVE_TRANSMITTER_ADDRESS_MATCHED, 0, g_i2c_slave_user_data[instance]);
            }
            
            /* 清除ADDR标志（读取SR1和SR2） */
            (void)i2c_periph->SR1;
            (void)i2c_periph->SR2;
        }
        
        /* 数据接收事件 */
        if (sr1 & I2C_FLAG_RXNE)
        {
            if (!(sr2 & I2C_FLAG_TRA))  /* 接收模式 */
            {
                data = I2C_ReceiveData(i2c_periph);
                g_i2c_slave_callback[instance](instance, I2C_EVENT_SLAVE_BYTE_RECEIVED, data, g_i2c_slave_user_data[instance]);
            }
        }
        
        /* 数据发送事件 */
        if (sr1 & I2C_FLAG_TXE)
        {
            if (sr2 & I2C_FLAG_TRA)  /* 发送模式 */
            {
                g_i2c_slave_callback[instance](instance, I2C_EVENT_SLAVE_BYTE_TRANSMITTING, 0, g_i2c_slave_user_data[instance]);
            }
        }
        
        /* STOP事件 */
        if (sr1 & I2C_FLAG_STOPF)
        {
            I2C_ClearFlag(i2c_periph, I2C_FLAG_STOPF);
            g_i2c_slave_callback[instance](instance, I2C_EVENT_SLAVE_STOP_DETECTED, 0, g_i2c_slave_user_data[instance]);
        }
        
        return;  /* 从模式处理完成，不执行主模式处理 */
    }
    
    /* 处理发送 */
    if (g_i2c_tx_buffer[instance] != NULL)
    {
        /* START位已发送 */
        if (sr1 & I2C_FLAG_SB)
        {
            /* 发送从机地址（写） */
            I2C_Send7bitAddress(i2c_periph, g_i2c_slave_addr[instance] << 1, I2C_Direction_Transmitter);
        }
        /* 地址已发送 */
        else if (sr1 & I2C_FLAG_ADDR)
        {
            /* 清除ADDR标志 */
            (void)sr2;  /* 读取SR2清除ADDR标志 */
            
            /* 发送第一个字节 */
            if (g_i2c_tx_index[instance] < g_i2c_tx_length[instance])
            {
                I2C_SendData(i2c_periph, g_i2c_tx_buffer[instance][g_i2c_tx_index[instance]++]);
            }
        }
        /* 发送缓冲区空 */
        else if (sr1 & I2C_FLAG_TXE)
        {
            if (g_i2c_tx_index[instance] < g_i2c_tx_length[instance])
            {
                /* 发送下一个字节 */
                I2C_SendData(i2c_periph, g_i2c_tx_buffer[instance][g_i2c_tx_index[instance]++]);
            }
            else
            {
                /* 发送完成，生成STOP */
                I2C_GenerateSTOP(i2c_periph, ENABLE);
                g_i2c_tx_buffer[instance] = NULL;
                g_i2c_status[instance] = I2C_OK;
                
