mdbsliguo/stm32_template_SPL/Drivers/i2c/i2c_hw.c
                /* 调用回调函数 */
                if (g_i2c_callback[instance] != NULL)
                {
                    g_i2c_callback[instance](instance, I2C_OK);
                }
            }
        }
    }
    /* 处理接收 */
    else if (g_i2c_rx_buffer[instance] != NULL)
    {
        /* START位已发送 */
        if (sr1 & I2C_FLAG_SB)
        {
            /* 发送从机地址（读） */
            if (g_i2c_rx_length[instance] == 1)
            {
                I2C_AcknowledgeConfig(i2c_periph, DISABLE);
            }
            I2C_Send7bitAddress(i2c_periph, g_i2c_slave_addr[instance] << 1, I2C_Direction_Receiver);
        }
        /* 地址已发送 */
        else if (sr1 & I2C_FLAG_ADDR)
        {
            /* 清除ADDR标志 */
            (void)sr2;  /* 读取SR2清除ADDR标志 */
            
            if (g_i2c_rx_length[instance] == 1)
            {
                I2C_AcknowledgeConfig(i2c_periph, DISABLE);
                I2C_GenerateSTOP(i2c_periph, ENABLE);
            }
            else if (g_i2c_rx_length[instance] == 2)
            {
                I2C_AcknowledgeConfig(i2c_periph, DISABLE);
            }
        }
        /* 接收数据就绪 */
        else if (sr1 & I2C_FLAG_RXNE)
        {
            if (g_i2c_rx_index[instance] < g_i2c_rx_length[instance])
            {
                g_i2c_rx_buffer[instance][g_i2c_rx_index[instance]++] = I2C_ReceiveData(i2c_periph);
                
                if (g_i2c_rx_index[instance] == g_i2c_rx_length[instance] - 1)
                {
                    I2C_AcknowledgeConfig(i2c_periph, DISABLE);
                    I2C_GenerateSTOP(i2c_periph, ENABLE);
                }
                else if (g_i2c_rx_index[instance] == g_i2c_rx_length[instance] - 2)
                {
                    I2C_AcknowledgeConfig(i2c_periph, DISABLE);
                }
                
                if (g_i2c_rx_index[instance] >= g_i2c_rx_length[instance])
                {
                    /* 接收完成 */
                    g_i2c_rx_buffer[instance] = NULL;
                    I2C_AcknowledgeConfig(i2c_periph, ENABLE);
                    g_i2c_status[instance] = I2C_OK;
                    
                    /* 调用回调函数 */
                    if (g_i2c_callback[instance] != NULL)
                    {
                        g_i2c_callback[instance](instance, I2C_OK);
                    }
                }
            }
        }
    }
}

/**
 * @brief I2C错误中断服务函数
 */
void I2C_ER_IRQHandler(I2C_Instance_t instance)
{
    I2C_TypeDef *i2c_periph;
    
    if (instance >= I2C_INSTANCE_MAX || !g_i2c_initialized[instance])
    {
        return;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 总线错误 */
    if (I2C_GetITStatus(i2c_periph, I2C_IT_BERR) != RESET)
    {
        I2C_ClearITPendingBit(i2c_periph, I2C_IT_BERR);
        g_i2c_status[instance] = I2C_ERROR_BUS_ERROR;
    }
    
    /* 仲裁丢失 */
    if (I2C_GetITStatus(i2c_periph, I2C_IT_ARLO) != RESET)
    {
        I2C_ClearITPendingBit(i2c_periph, I2C_IT_ARLO);
        g_i2c_status[instance] = I2C_ERROR_ARBITRATION_LOST;
    }
    
    /* 应答失败 */
    if (I2C_GetITStatus(i2c_periph, I2C_IT_AF) != RESET)
    {
        I2C_ClearITPendingBit(i2c_periph, I2C_IT_AF);
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        g_i2c_status[instance] = I2C_ERROR_NACK;
    }
    
    /* 清除发送/接收缓冲区 */
    g_i2c_tx_buffer[instance] = NULL;
    g_i2c_rx_buffer[instance] = NULL;
    
    /* 调用回调函数 */
    if (g_i2c_callback[instance] != NULL)
    {
        g_i2c_callback[instance](instance, g_i2c_status[instance]);
    }
}

/* I2C中断服务程序入口 */
void I2C1_EV_IRQHandler(void)
{
    I2C_EV_IRQHandler(I2C_INSTANCE_1);
}

void I2C1_ER_IRQHandler(void)
{
    I2C_ER_IRQHandler(I2C_INSTANCE_1);
}

void I2C2_EV_IRQHandler(void)
{
    I2C_EV_IRQHandler(I2C_INSTANCE_2);
}

void I2C2_ER_IRQHandler(void)
{
    I2C_ER_IRQHandler(I2C_INSTANCE_2);
}

/* ========== 10位地址功能实现 ========== */

/**
 * @brief I2C主模式发送数据（10位地址）
 */
I2C_Status_t I2C_MasterTransmit10bit(I2C_Instance_t instance, uint16_t slave_addr, 
                                      const uint8_t *data, uint16_t length, uint32_t timeout)
{
    I2C_TypeDef *i2c_periph;
    I2C_Status_t status;
    uint16_t i;
    uint32_t actual_timeout;
    uint8_t addr_high, addr_low;
    
    /* 参数校验 */
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (slave_addr > 0x3FF)
    {
        return I2C_ERROR_INVALID_PARAM;  /* 10位地址范围：0x000-0x3FF */
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    actual_timeout = (timeout == 0) ? I2C_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 提取10位地址的高8位和低2位 */
    /* 10位地址格式：11110XX + XXXXXXXXXX（高2位+低8位） */
    addr_high = 0xF0 | ((slave_addr >> 7) & 0x06);  /* 11110XX */
    addr_low = slave_addr & 0x00FF;  /* 低8位 */
    
    /* 等待总线空闲 */
    status = I2C_WaitBusIdle(i2c_periph, actual_timeout);
    if (status != I2C_OK)
    {
        return status;
    }
    
    /* 生成START信号 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送10位地址的高字节（写模式） */
    I2C_SendData(i2c_periph, addr_high);
    
    /* 等待ADD10事件（10位地址模式已选择） */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_ADDRESS10, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送10位地址的低字节 */
    I2C_SendData(i2c_periph, addr_low);
    
    /* 等待地址发送完成并收到ACK（EV6） */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送数据 */
    for (i = 0; i < length; i++)
    {
        if (i > 0)
        {
            /* 等待数据寄存器为空（TXE标志） */
            status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_TRANSMITTING, actual_timeout);
            if (status != I2C_OK)
            {
                I2C_GenerateSTOP(i2c_periph, ENABLE);
                return status;
            }
        }
        
        /* 发送数据 */
        I2C_SendData(i2c_periph, data[i]);
    }
    
    /* 等待最后一个字节发送完成（BTF标志） */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_TRANSMITTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 生成STOP信号 */
    I2C_GenerateSTOP(i2c_periph, ENABLE);
    
    return I2C_OK;
}

/**
 * @brief I2C主模式接收数据（10位地址）
 */
I2C_Status_t I2C_MasterReceive10bit(I2C_Instance_t instance, uint16_t slave_addr, 
                                     uint8_t *data, uint16_t length, uint32_t timeout)
{
    I2C_TypeDef *i2c_periph;
    I2C_Status_t status;
    uint16_t i;
    uint32_t actual_timeout;
    uint8_t addr_high, addr_low;
    
    /* 参数校验 */
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
