mdbsliguo/stm32_template_SPL/Drivers/i2c/i2c_hw.c
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (data == NULL || length == 0)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (slave_addr > 0x3FF)
    {
        return I2C_ERROR_INVALID_PARAM;  /* 10位地址范围：0x000-0x3FF */
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    actual_timeout = (timeout == 0) ? I2C_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 提取10位地址的高8位和低2位 */
    addr_high = 0xF0 | ((slave_addr >> 7) & 0x06);  /* 11110XX */
    addr_low = slave_addr & 0x00FF;  /* 低8位 */
    
    /* 等待总线空闲 */
    status = I2C_WaitBusIdle(i2c_periph, actual_timeout);
    if (status != I2C_OK)
    {
        return status;
    }
    
    /* 生成START信号 */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送10位地址的高字节（写模式，用于地址匹配） */
    I2C_SendData(i2c_periph, addr_high);
    
    /* 等待ADD10事件 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_ADDRESS10, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送10位地址的低字节 */
    I2C_SendData(i2c_periph, addr_low);
    
    /* 等待地址发送完成（EV6） */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 生成重复START信号（切换到接收模式） */
    I2C_GenerateSTART(i2c_periph, ENABLE);
    
    /* 等待重复START信号发送完成 */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_MODE_SELECT, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 发送10位地址的高字节（读模式） */
    I2C_Send7bitAddress(i2c_periph, addr_high | 0x01, I2C_Direction_Receiver);
    
    /* 等待地址发送完成并收到ACK（EV6） */
    status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, actual_timeout);
    if (status != I2C_OK)
    {
        I2C_GenerateSTOP(i2c_periph, ENABLE);
        return status;
    }
    
    /* 接收数据 */
    for (i = 0; i < length; i++)
    {
        if (i < length - 1)
        {
            /* 等待数据接收完成（RXNE标志） */
            status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_RECEIVED, actual_timeout);
            if (status != I2C_OK)
            {
                I2C_GenerateSTOP(i2c_periph, ENABLE);
                return status;
            }
            
            /* 使能ACK（继续接收） */
            I2C_AcknowledgeConfig(i2c_periph, ENABLE);
        }
        else
        {
            /* 最后一个字节：禁用ACK */
            I2C_AcknowledgeConfig(i2c_periph, DISABLE);
            
            /* 等待数据接收完成 */
            status = I2C_WaitFlag(i2c_periph, I2C_EVENT_MASTER_BYTE_RECEIVED, actual_timeout);
            if (status != I2C_OK)
            {
                I2C_GenerateSTOP(i2c_periph, ENABLE);
                I2C_AcknowledgeConfig(i2c_periph, ENABLE);  /* 恢复ACK */
                return status;
            }
        }
        
        /* 读取数据 */
        data[i] = I2C_ReceiveData(i2c_periph);
    }
    
    /* 生成STOP信号 */
    I2C_GenerateSTOP(i2c_periph, ENABLE);
    
    /* 恢复ACK */
    I2C_AcknowledgeConfig(i2c_periph, ENABLE);
    
    return I2C_OK;
}

/* ========== 从模式功能实现 ========== */

/* 从模式回调函数 */
static I2C_SlaveCallback_t g_i2c_slave_callback[I2C_INSTANCE_MAX] = {NULL};
static void *g_i2c_slave_user_data[I2C_INSTANCE_MAX] = {NULL};
static bool g_i2c_slave_mode[I2C_INSTANCE_MAX] = {false};

/**
 * @brief I2C从模式初始化
 */
I2C_Status_t I2C_SlaveInit(I2C_Instance_t instance, uint8_t slave_address,
                           I2C_SlaveCallback_t callback, void *user_data)
{
    I2C_InitTypeDef I2C_InitStructure;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (slave_address > 0x7F)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    /* 如果已初始化为主模式，需要先反初始化 */
    if (g_i2c_initialized[instance])
    {
        I2C_Deinit(instance);
    }
    
    /* 使能I2C外设时钟 */
    RCC_APB1PeriphClockCmd(I2C_GetPeriphClock(g_i2c_configs[instance].i2c_periph), ENABLE);
    
    /* 配置I2C为从模式 */
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = slave_address << 1;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed = 100000;
    
    I2C_Init(g_i2c_configs[instance].i2c_periph, &I2C_InitStructure);
    I2C_Cmd(g_i2c_configs[instance].i2c_periph, ENABLE);
    
    /* 使能地址匹配中断 */
    I2C_ITConfig(g_i2c_configs[instance].i2c_periph, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR, ENABLE);
    
    g_i2c_slave_callback[instance] = callback;
    g_i2c_slave_user_data[instance] = user_data;
    g_i2c_slave_mode[instance] = true;
    g_i2c_initialized[instance] = true;
    
    return I2C_OK;
}

/**
 * @brief I2C从模式反初始化
 */
I2C_Status_t I2C_SlaveDeinit(I2C_Instance_t instance)
{
    if (instance >= I2C_INSTANCE_MAX || !g_i2c_slave_mode[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    I2C_ITConfig(g_i2c_configs[instance].i2c_periph, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR, DISABLE);
    I2C_Cmd(g_i2c_configs[instance].i2c_periph, DISABLE);
    
    g_i2c_slave_callback[instance] = NULL;
    g_i2c_slave_user_data[instance] = NULL;
    g_i2c_slave_mode[instance] = false;
    g_i2c_initialized[instance] = false;
    
    return I2C_OK;
}

/**
 * @brief I2C从模式发送数据
 */
I2C_Status_t I2C_SlaveTransmit(I2C_Instance_t instance, uint8_t data)
{
    if (instance >= I2C_INSTANCE_MAX || !g_i2c_slave_mode[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    uint32_t timeout = Delay_GetTick() + I2C_DEFAULT_TIMEOUT_MS;
    while (I2C_GetFlagStatus(g_i2c_configs[instance].i2c_periph, I2C_FLAG_TXE) == RESET)
    {
        if (Delay_GetElapsed(Delay_GetTick(), timeout) > I2C_DEFAULT_TIMEOUT_MS)
        {
            return I2C_ERROR_TIMEOUT;
        }
    }
    
    I2C_SendData(g_i2c_configs[instance].i2c_periph, data);
    return I2C_OK;
}

/**
 * @brief I2C从模式接收数据
 */
I2C_Status_t I2C_SlaveReceive(I2C_Instance_t instance, uint8_t *data)
{
    if (instance >= I2C_INSTANCE_MAX || !g_i2c_slave_mode[instance] || data == NULL)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    uint32_t timeout = Delay_GetTick() + I2C_DEFAULT_TIMEOUT_MS;
    while (I2C_GetFlagStatus(g_i2c_configs[instance].i2c_periph, I2C_FLAG_RXNE) == RESET)
    {
        if (Delay_GetElapsed(Delay_GetTick(), timeout) > I2C_DEFAULT_TIMEOUT_MS)
        {
            return I2C_ERROR_TIMEOUT;
        }
    }
    
