mdbsliguo/stm32_template_SPL/Drivers/i2c/i2c_hw.c
    *data = I2C_ReceiveData(g_i2c_configs[instance].i2c_periph);
    return I2C_OK;
}

/* 修改I2C_EV_IRQHandler以支持从模式 - 需要在现有函数中添加从模式处理 */
/* 由于I2C_EV_IRQHandler已经存在，我们需要在函数开头检查是否为从模式 */

/* ========== SMBus/PEC功能实现 ========== */

/**
 * @brief 使能I2C PEC计算
 */
I2C_Status_t I2C_EnablePEC(I2C_Instance_t instance)
{
    I2C_TypeDef *i2c_periph;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 使能PEC计算 */
    I2C_CalculatePEC(i2c_periph, ENABLE);
    
    return I2C_OK;
}

/**
 * @brief 禁用I2C PEC计算
 */
I2C_Status_t I2C_DisablePEC(I2C_Instance_t instance)
{
    I2C_TypeDef *i2c_periph;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 禁用PEC计算 */
    I2C_CalculatePEC(i2c_periph, DISABLE);
    
    return I2C_OK;
}

/**
 * @brief 使能I2C PEC传输
 */
I2C_Status_t I2C_EnablePECTransmission(I2C_Instance_t instance)
{
    I2C_TypeDef *i2c_periph;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 使能PEC传输 */
    I2C_TransmitPEC(i2c_periph, ENABLE);
    
    return I2C_OK;
}

/**
 * @brief 禁用I2C PEC传输
 */
I2C_Status_t I2C_DisablePECTransmission(I2C_Instance_t instance)
{
    I2C_TypeDef *i2c_periph;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 禁用PEC传输 */
    I2C_TransmitPEC(i2c_periph, DISABLE);
    
    return I2C_OK;
}

/**
 * @brief 配置I2C PEC位置
 */
I2C_Status_t I2C_ConfigPECPosition(I2C_Instance_t instance, I2C_PECPosition_t position)
{
    I2C_TypeDef *i2c_periph;
    uint16_t pec_position;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (position >= 2)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 转换PEC位置枚举值 */
    pec_position = (position == I2C_PEC_POSITION_NEXT) ? I2C_PECPosition_Next : I2C_PECPosition_Current;
    
    /* 配置PEC位置 */
    I2C_PECPositionConfig(i2c_periph, pec_position);
    
    return I2C_OK;
}

/**
 * @brief 获取I2C PEC值
 */
uint8_t I2C_GetPEC(I2C_Instance_t instance)
{
    I2C_TypeDef *i2c_periph;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return 0;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return 0;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 读取PEC值 */
    return I2C_GetPEC(i2c_periph);
}

/**
 * @brief 配置I2C SMBus Alert引脚
 */
I2C_Status_t I2C_ConfigSMBusAlert(I2C_Instance_t instance, I2C_SMBusAlert_t alert_level)
{
    I2C_TypeDef *i2c_periph;
    uint16_t smbus_alert;
    
    if (instance >= I2C_INSTANCE_MAX)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    if (!g_i2c_initialized[instance])
    {
        return I2C_ERROR_NOT_INITIALIZED;
    }
    
    if (alert_level >= 2)
    {
        return I2C_ERROR_INVALID_PARAM;
    }
    
    i2c_periph = g_i2c_configs[instance].i2c_periph;
    
    /* 转换SMBus Alert枚举值 */
    smbus_alert = (alert_level == I2C_SMBUS_ALERT_LOW) ? I2C_SMBusAlert_Low : I2C_SMBusAlert_High;
    
    /* 配置SMBus Alert引脚 */
    I2C_SMBusAlertConfig(i2c_periph, smbus_alert);
    
    return I2C_OK;
}

#endif /* CONFIG_MODULE_I2C_ENABLED */

